package main.java.com.ohgiraffers.section01.conditional.question;

public class Result {
    public static void main(String[] args) {

        /*
         * a, b, c 세 과목의 점수를 스캐너로 입력받고,
         * 세 과목의 점수를 만든 메소드의 매개변수로 전달해 평균을 계산, 평균을 이용하여 합격 / 불합격 처리를 하는 기능을 구현하세요.
         * (합격조건: 세 과목의 점수가 각각 40점을 넘어야하고, 평균은 60점을 넘어야 합니다)
         * 합격했을 경우, 그 학생의 평균점수와 "합격입니다!"를 출력하고,
         * 불합격인 경우, "불합격입니다!"를 출력해주세요.
         * */

        /*
         * 1. 세 과목 점수 입력받기
         * 1-1. 스캐너 사용해서 입력창 만들기
         * 1-2. 사용자에게 점수입력 메세지
         * 1-3. 점수 저장하기

         * 2. 메소드 만들기 매개변수 3개인 <- 평균 구하는 메소드
         * 2-1. 매개변수로 전달받은 값이 40이 넘어서는지 확인

         * 3. 합격과 불합격 처리
         * */

        Point p = new Point();
        p.point();   // point 메소드 불러옴
    }
}
